app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5)  [["post_id", 6], ["post_id", 7], ["post_id", 8], ["post_id", 9], ["post_id", 10]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
    <div class="comLik">
    <p>Comments: <%= post.comments.count %>, Likes: <%= post.likes.count %></p>

SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 1], ["LIMIT", 1]]
---

  <% if post.recent_comments.any? %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  <% post.recent_comments.each do |comment| %>
            <% if comment.user.present? %>