app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_current_user
    user_id = params[:user_id]
    @current_user = User.find_by(id: user_id)